Add mermaid charts
